In [1]:
import pandas as pd

In [2]:

df_customers = pd.DataFrame({
    "customer_id": [1, 2, 3, 4],
    "name": ["Adam", "Bob", "Charlie", "Dave"]
})

df_orders = pd.DataFrame({
    "order_id": [101, 102, 103, 104, 105],
    "customer_id": [1, 2, 1, 3, 5],   # notice 5 does not exist in customers
    "amount": [250, 450, 300, 150, 500]
})

In [3]:
df_customers

   customer_id     name
0            1     Adam
1            2      Bob
2            3  Charlie
3            4     Dave

In [4]:
df_orders

   order_id  customer_id  amount
0       101            1     250
1       102            2     450
2       103            1     300
3       104            3     150
4       105            5     500

In [6]:
pd.merge(df_customers,df_orders,on="customer_id")  # inner join

   customer_id     name  order_id  amount
0            1     Adam       101     250
1            1     Adam       103     300
2            2      Bob       102     450
3            3  Charlie       104     150

In [7]:
left_join = pd.merge(
    df_customers,
    df_orders,
    on="customer_id",
    how="left"
)

left_join

   customer_id     name  order_id  amount
0            1     Adam     101.0   250.0
1            1     Adam     103.0   300.0
2            2      Bob     102.0   450.0
3            3  Charlie     104.0   150.0
4            4     Dave       NaN     NaN

In [8]:
right_join = pd.merge(
    df_customers,
    df_orders,
    on="customer_id",
    how="right"
)

right_join

   customer_id     name  order_id  amount
0            1     Adam       101     250
1            2      Bob       102     450
2            1     Adam       103     300
3            3  Charlie       104     150
4            5      NaN       105     500

In [9]:
outer_join = pd.merge(
    df_customers,
    df_orders,
    on="customer_id",
    how="outer"
)

outer_join

   customer_id     name  order_id  amount
0            1     Adam     101.0   250.0
1            1     Adam     103.0   300.0
2            2      Bob     102.0   450.0
3            3  Charlie     104.0   150.0
4            4     Dave       NaN     NaN
5            5      NaN     105.0   500.0